In [3]:
import pandas as pd
df = pd.read_csv('./data/student.csv')

In [4]:
df

   StudentID    Name  Subject  Score Class
0          1  Anjali     Math     85   10A
1          2   Rohan     Math     90   10A
2          3   Aarav  Science     75   10B
3          4   Sneha  Science     80   10B
4          5    Tina     Math     88   10B
5          6   Rohan  Science     70   10A
6          7  Anjali  Science     95   10A

In [11]:
df.groupby('Subject')['Score'].mean()

Subject
Math       87.666667
Science    80.000000
Name: Score, dtype: float64

In [12]:
df.groupby('Class')['Score'].max()

Class
10A    95
10B    88
Name: Score, dtype: int64

In [20]:
df.groupby('Subject')['Name'].count()

Subject
Math       3
Science    4
Name: Name, dtype: int64

In [22]:
df.groupby('Class')['Score'].agg(['mean','max','min'])

       mean  max  min
Class
10A    85.0   95   70
10B    81.0   88   75